#include<stdio.h>
int main()
{
    int n,a,b,c,d,e,f,g,h,x=1;
    printf("请输入一个不多于八位的正整数：");
    scanf("%d",&n);
    //求位数
    if((n/10)>0)x++;
    if((n/100)>0)x++;
    if((n/1000)>0)x++;
    if((n/10000)>0)x++;
    if((n/100000)>0)x++;
    if((n/1000000)>0)x++;
    if((n/10000000)>0)x++;
    //求各位数字
    printf("各位数字是：");
    switch(x)
    {
    case 8:a=(n-n/100000000*100000000)/10000000;printf("%-2d",a);
    case 7:b=(n-n/10000000*10000000)/1000000;printf("%-2d",b);
    case 6:c=(n-n/1000000*1000000)/100000;printf("%-2d",c);
    case 5:d=(n-n/100000*100000)/10000;printf("%-2d",d);
    case 4:e=(n-n/10000*10000)/1000;printf("%-2d",e);
    case 3:f=(n-n/1000*1000)/100;printf("%-2d",f);
    case 2:g=(n-n/100*100)/10;printf("%-2d",g);
    case 1:h=(n-n/10*10);printf("%-2d",h);
    }
    printf("\n");
    printf("这是一个%d位数\n",x);
    //求其逆序
    if(x==8)a=h*10000000+g*1000000+f*100000+e*10000+d*1000+c*100+b*10+a;
    if(x==7)a=h*1000000+g*100000+f*10000+e*1000+d*100+c*10+b;
    if(x==6)a=h*100000+g*10000+f*1000+e*100+d*10+c;
    if(x==5)a=h*10000+g*1000+f*100+e*10+d;
    if(x==4)a=h*1000+g*100+f*10+e;
    if(x==3)a=h*100+g*10+f;
    if(x==2)a=h*10+g;
    if(x==1)a=a;
    printf("倒序为：%d\n",a);
	return 0;
}
